# Telecom operators codes (RU)
OPERATOR_RU_CODES = {'Tele2': [908, 930, 958, 969, 977, 993, 995, 999],
                     'МегаФон': [902, 904, 908, 920, 922, 925, 926, 927, 928, 934, 936, 938, 950, 951],
                     'МТС': [901, 902, 904, 908, 910, 912, 913, 914, 915, 916, 917, 918, 919, 950, 978, 980, 982, 983, 984, 985, 987, 988],
                     'Билайн': [900, 902, 904, 908, 930, 933, 950, 951, 953, 980, 983, 986, 994],
                     'Yota': [956, 958, 991, 995, 996],
                     'Ростелеком': [901, 902, 912, 930, 939, 970, 971, 992],
                     'МТТ': [908, 912, 919, 924, 931, 932, 933, 934, 936, 939, 961, 963, 966, 977, 980, 982, 984, 985, 986, 988, 991, 992, 993, 994,
                             995, 996],
                     'Тинькофф мобайл': [993],
                     'СберМобайл': [901, 933, 938, 966, 989, 992, 993],
                     'Газпромбанк Мобайл': [900]}

# Weights for choosing operators
WEIGHTS_FOR_RU_OPERATORS = {'Tele2': 0.1,
                            'МегаФон': 0.1,
                            'МТС': 0.1,
                            'Билайн': 0.1,
                            'Yota': 0.1,
                            'Ростелеком': 0.1,
                            'МТТ': 0.1,
                            'Тинькофф мобайл': 0.1,
                            'СберМобайл': 0.1,
                            'Газпромбанк Мобайл': 0.1}

# Telecom operators codes (ONLY SPB)
OPERATOR_SPB_CODES = {'Tele2': [900, 901, 902, 904, 950, 951, 952, 953, 991, 992, 994, 996],
                      'МегаФон': [921, 923, 924, 929, 930, 931, 932, 933, 937, 939, 958, 999],
                      'МТС': [911, 958, 981, 986, 989],
                      'Билайн': [903, 905, 906, 909, 960, 961, 962, 963, 964, 965, 966, 967, 968, 969],
                      'Yota': [999],
                      'Ростелеком': [958, 991, 993],
                      'МТТ': [901, 923, 930, 938, 958, 967, 969, 981, 983, 989, 999],
                      'Тинькофф мобайл': [995],
                      'СберМобайл': [930, 932, 939, 958, 977, 980, 995, 996],
                      'Газпромбанк Мобайл': [958]}

# Weight for choosing is phone number from S.Petersburg
OPERATOR_WEIGHTS_FOR_SPB = {'Tele2': 0.67,
                            'МегаФон': 0.82,
                            'МТС': 0.56,
                            'Билайн': 0.74,
                            'Yota': 0.88,
                            'Ростелеком': 0.79,
                            'МТТ': 0.45,
                            'Тинькофф мобайл': 0.81,
                            'СберМобайл': 0.67,
                            'Газпромбанк Мобайл': 0.5}

# Weights for choosing job titles
WEIGHTS_FOR_JOB_TITLES = {'Ген. директор': 0.01,
                          'Начальник': 0.05,
                          'Охранник': 0.05,  # amount
                          'Уборщик': 0.05,  # should
                          'Комендант': 0.05,  # be
                          'Продавец': 0.05,  # 0.2
                          'Бухгалтер': 0.1,
                          'Менеджер': 0.2,
                          'Программист': 0.1,  # amount
                          'Инженер': 0.1,  # should
                          'Медик': 0.1,  # be
                          'Маркетолог': 0.1,  # 0.4
                          'Секретарь': 0.04}

# Salary for every job titles
SALARY = {'Ген. директор': 125000,
          'Начальник': 92000,
          'Охранник': 39000,
          'Уборщик': 33000,
          'Комендант': 52000,
          'Продавец': 46000,
          'Бухгалтер': 62000,
          'Менеджер': 67000,
          'Программист': 115000,
          'Инженер': 77000,
          'Медик': 73000,
          'Маркетолог': 72000,
          'Секретарь': 45000}

# Weights for choosing is job for half-time
WEIGHTS_FOR_HALF_TIME = {'Ген. директор': 0,
                         'Начальник': 0,
                         'Охранник': 0.5,
                         'Уборщик': 0.7,
                         'Комендант': 0,
                         'Продавец': 0.4,
                         'Бухгалтер': 0,
                         'Менеджер': 0.3,
                         'Программист': 0.2,
                         'Инженер': 0.25,
                         'Медик': 0.35,
                         'Маркетолог': 0,
                         'Секретарь': 0}
